#+TITLE: Literate Programming in Emacs and Finances
#+DATE: [2022-11-02 qua]
#+AUTHOR: Vinícius Gajo
#+STARTUP: latexpreview

** Fsharp Solution

And this is the same algorithm implemented in F#. Notice that the result is way
more polluted.

In the future I'm going to study more about this problem, and if I manage to
find a solution I'll update this document.

#+NAME: finance-fsx
#+HEADER: :var X_0=1e4 :var Y=1e3 :var H=1.01 :var N=120
#+BEGIN_SRC fsharp
  let rec calcMoney (x0: float) (y: float) (h: float) (nMonth: int): float =
      match nMonth with
      | 0 -> x0
      | _ when (nMonth > 0) ->
          let previousValue = calcMoney (x0) (y) (h) (nMonth - 1)
          (previousValue * h) + y
      | _ -> 0

  let main () =
      let resultMoney = calcMoney (X_0) (Y) (H) (N)

      printfn """
      Initial money: %.2f
      Addition per month: %.2f
      Increase rate per month: %.2f
      Investment time: %i months
      Final value: %.2f moneys
      """ (X_0) (Y) (H) (N) (resultMoney)

  main ()
#+END_SRC

#+RESULTS: finance-fsx
#+begin_example
let rec calcMoney (x0: float) (y: float) (h: float) (nMonth: int): float =
    match nMonth with
    | 0 -> x0
    | _ when (nMonth > 0) ->
        let previousValue = calcMoney (x0) (y) (h) (nMonth - 1)
        (previousValue * h) + y
    | _ -> 0

let main () =
    let resultMoney = calcMoney (X_0) (Y) (H) (N)

    printfn """
    Initial money: %.2f
    Addition per month: %.2f
    Increase rate per month: %.2f
    Investment time: %i months
    Final value: %.2f moneys
    """ (X_0) (Y) (H) (N) (resultMoney)

main ();;

    Initial money: 10000.00
    Addition per month: 1000.00
    Increase rate per month: 1.01
    Investment time: 120 months
    Final value: 263042.56 moneys
    
val calcMoney: x0: float -> y: float -> h: float -> nMonth: int -> float
val main: unit -> unit
val it: unit = ()
#+end_example

